[
    {
        "id": 6,
        "content": "Introducing **Domain Management** in SixFocus! 🌟\n\nStarting from **version 1.2.0**, you can now organize your tasks by different areas of your life—such as **work and home**—using domains. While SixFocus encourages focusing on **six key tasks per day**, domains help you structure your productivity without losing clarity. ✨\n\nAlthough you can create **unlimited domains**, we recommend keeping them to a **minimum** to maintain your focus. Too many domains may **dilute your attention** rather than enhance productivity. 🎯\n\nYou can access domains through **Settings > Domains**, or by adding a **Domain icon** to the to-do list screen in **Settings > Appearance**. This feature will be available in **version 1.2.0**, which will be approved soon. 🚀 Stay tuned and enhance your workflow with SixFocus!",
        "date": "12/2/2025"
    },
    {
        "id": 5,
        "content": "Unleash Your Creativity with Custom Quotes! ✨\n\nStarting from **version 1.1.0**, SixFocus now includes the **Custom Quotes feature**, allowing you to create your own inspiring quotes or save the ones that truly resonate with you. \n\nCraft words that motivate you daily and keep your focus strong! 💡\n\nUpdate now and personalize your inspiration! 🚀",
        "date": "12/2/2025"
    },
    {
        "id": 4,
        "content": "Stay Updated with SixFocus! 🔔\n\nStarting from **version 1.1.0**, SixFocus includes an **update notification feature** to keep you informed about the latest improvements. However, if you are using a version **below 1.1.0**, you won’t receive update alerts automatically.\n\nIf you haven’t updated yet, please manually update to the latest version to enjoy all the new features and enhancements! 🚀\n\nWishing you continued success in your productivity journey. Stay focused and keep achieving your goals! 💙",
        "date": "9/2/2025"
    },
    {
        "id": 3,
        "content": "Keep Your Momentum Going with SixFocus! 🚀\n\nYou're doing amazing! Here's another tip to maximize your productivity: Break larger tasks into smaller, manageable steps. This makes even the most daunting goals feel achievable and keeps you motivated as you check off each step. Remember, consistency is the key to success—keep up the great work!",
        "date": "16/1/2025"
    },
    {
        "id": 2,
        "content": "Discover the Power of SixFocus! 🌟\n\nGreat to see you making progress! Here’s a tip to get even more out of SixFocus: Prioritize your tasks by focusing on the most important ones first. Did you know? Completing just one high-impact task can make your entire day feel productive. Let’s keep moving forward-your goals are waiting!",
        "date": "16/1/2025"
    },
    {
        "id": 1,
        "content": "Welcome to SixFocus! 📢\n\nWe’re excited to have you here. SixFocus is designed to help you manage your time effectively and achieve your goals. Set your first task and take the first step towards a more productive day! 😊",
        "date": "16/1/2025"
    }
]
